frontend/controllers/SiteController.php

    public function actionIndex()
    {
        $dataProvider = new ActiveDataProvider([
            'query' => Article::find()->published(),
            'sort' => [
                'defaultOrder' => [
                    'is_top' => SORT_DESC,
                    'published_at' => SORT_DESC
                ]
            ]
        ]);
        if (!(new \Detection\MobileDetect())->isMobile())
        {
           $image = CarouselItem::find()->where(['status'=>1,'carousel_id'=>1])->orderBy('sort asc')->all();
           $categories = Category::find()->orderBy(['sort' => SORT_ASC])->limit(6)->all();
        }else {
            //手机端分类
            $image = CarouselItem::find()->where(['status'=>1,'carousel_id'=>9])->orderBy('sort asc')->all();
            $categories = Category::find()->orderBy(['sort' => SORT_ASC])->limit(2)->all();
---
SELECT * FROM `yj_category` ORDER BY `sort` LIMIT 6
SELECT * FROM `yj_category` ORDER BY `sort` LIMIT 2