common/components/PackageInfo.php

    public function getModel()
    {
        if ($this->_model == null) {
            $model = Module::findOne($this->getPackage());
---
SELECT * FROM `yj_module` WHERE `id`='area'