common/modules/attachment/behaviors/UploadBehavior.php

SELECT * FROM `yj_attachment_index` WHERE (`entity_id`=367) AND (`entity`='common\\models\\Article') AND (`attribute`='cover')
SELECT * FROM `yj_attachment` WHERE 0=1
---
    public function getAttachments()
    {
        $attachmentIndex = AttachmentIndex::find()->where([
            'entity_id' =>  $this->getEntityId(),//模式数据的id
            'entity' => $this->getEntity(),//模型
            'attribute' => $this->attribute
        ])->all();
        $attachmentIds = ArrayHelper::getColumn($attachmentIndex, 'attachment_id');
        return Attachment::findAll(['id' => $attachmentIds]);